/* CHANNEL.H    (c) Copyright Roger Bowler, 1994-2012                */
/*              ESA/390 Data Areas                                   */
/*                                                                   */
/*   Released under "The Q Public License Version 1"                 */
/*   (http://www.hercules-390.org/herclic.html) as modifications to  */
/*   Hercules.                                                       */

#ifndef _CHANNEL_H
#define _CHANNEL_H

/* Platform-independent storage operand definitions */

#include "htypes.h"         // (need Hercules fixed-size data types)


/* Channel Report Word definitions */
#define CRW_FLAGS_MASK  0xF0C00000      /* Flags mask                */
//      (unassigned)    0x80000000      /* (unassigned)              */
#define CRW_SOL         0x40000000      /* Solicited CRW             */
#define CRW_OFLOW       0x20000000      /* Overflow, some CRW's lost */
#define CRW_CHAIN       0x10000000      /* More CRW's describe event */
#define CRW_RSC_MASK    0x0F000000      /* Reporting-Source Code mask*/
#define CRW_RSC_MONIT   0x02000000      /* Channel Monitor is source */
#define CRW_RSC_SUBCH   0x03000000      /* Subchannel is source      */
#define CRW_RSC_CHPID   0x04000000      /* Channel Path is source    */
#define CRW_RSC_CAF     0x09000000      /* Config. Alert Facility    */
#define CRW_RSC_CSS     0x0B000000      /* Channel subsys is source  */
#define CRW_AR          0x00800000      /* Ancillary Report indicator*/
//      (unassigned)    0x00400000      /* (unassigned)              */
#define CRW_ERC_MASK    0x003F0000      /* Error-Recovery Code mask  */
#define CRW_ERC_NULL    0x00000000      /* Event Information Pending */
#define CRW_ERC_AVAIL   0x00010000      /* Available                 */
#define CRW_ERC_INIT    0x00020000      /* Initialized, no parms chg.*/
#define CRW_ERC_TEMP    0x00030000      /* Temporary error           */
#define CRW_ERC_ALERT   0x00040000      /* Installed, parms changed  */
#define CRW_ERC_ABORT   0x00050000      /* Terminal                  */
#define CRW_ERC_ERROR   0x00060000      /* Perm. error, not init'ed  */
#define CRW_ERC_RESET   0x00070000      /* Perm. error, initialized  */
#define CRW_ERC_MODFY   0x00080000      /* PIM, PAM or CHPIDs changed*/
#define CRW_ERC_RSTRD   0x000A0000      /* PIM, PAM or CHPID restored*/
#define CRW_RSID_MASK   0x0000FFFF      /* Reporting-Source ID mask  */

/* Bit settings for channel id */
#define CHANNEL_TYPE    0xF0000000      /* Bits 0-3=Channel type...  */
#define CHANNEL_SEL     0x00000000      /* ...selector channel       */
#define CHANNEL_MPX     0x10000000      /* ...byte multiplexor       */
#define CHANNEL_BMX     0x20000000      /* ...block multiplexor      */
#define CHANNEL_MODEL   0x0FFF0000      /* Bits 4-15=Channel model   */
#define CHANNEL_MAXIOEL 0x0000FFFF      /* Bits 16-31=Max.IOEL length*/


/* Operation-Request Block (ORB) structure definition */
typedef struct _ORB {
        FWORD   intparm;                /* Interruption parameter    */
        BYTE    flag4;                  /* Flag byte 4               */
        BYTE    flag5;                  /* Flag byte 5               */
        BYTE    lpm;                    /* Logical path mask         */
        BYTE    flag7;                  /* Flag byte 7               */
        FWORD   ccwaddr;                /* CCW address               */
        BYTE    csspriority;            /* CSS Priority              */
        BYTE    reserved_byte_13;       /* Reserved for future use   */
        BYTE    cupriority;             /* CU Priority               */
        BYTE    reserved_byte_15;       /* Reserved for future use   */
        FWORD   reserved_word_4;        /* Reserved for future use   */
        FWORD   reserved_word_5;        /* Reserved for future use   */
        FWORD   reserved_word_6;        /* Reserved for future use   */
        FWORD   reserved_word_7;        /* Reserved for future use   */
    } ORB;

/* Bit definitions for ORB flag byte 4 */
#define ORB4_KEY        0xF0            /* Subchannel protection key */
#define ORB4_S          0x08            /* Suspend control           */
#define ORB4_C          0x04            /* Streaming mode (FICON)    */
#define ORB4_M          0x02            /* Modification (FICON)      */
#define ORB4_Y          0x01            /* Synchronization (FICON)   */

/* Bit definitions for ORB flag byte 5 */
#define ORB5_F          0x80            /* CCW format                */
#define ORB5_P          0x40            /* Prefetch                  */
#define ORB5_I          0x20            /* Initial status interrupt  */
#define ORB5_A          0x10            /* Address limit checking    */
#define ORB5_U          0x08            /* Suppress susp interrupt   */
#define ORB5_B          0x04            /* Channel Program Type      */
#define ORB5_H          0x02            /* Format-2 IDAW control     */
#define ORB5_T          0x01            /* 2K format-2 IDAW control  */

/* Bit definitions for ORB flag byte 7 */
#define ORB7_L          0x80            /* Suppress incorrect length */
#define ORB7_D          0x40            /* MIDAW control          @MW*/
#define ORB7_RESV       0x3E            /* Reserved - must be 0   @MW*/
#define ORB7_X          0x01            /* ORB extension control     */

/* Path management control word structure definition */
typedef struct _PMCW {
/*000*/ FWORD   intparm;                /* Interruption parameter    */
/*004*/ BYTE    flag4;                  /* Flag byte 4               */
/*005*/ BYTE    flag5;                  /* Flag byte 5               */
/*006*/ HWORD   devnum;                 /* Device number             */
/*008*/ BYTE    lpm;                    /* Logical path mask         */
/*009*/ BYTE    pnom;                   /* Path not operational mask */
/*00A*/ BYTE    lpum;                   /* Last path used mask       */
/*00B*/ BYTE    pim;                    /* Path installed mask       */
/*00C*/ HWORD   mbi;                    /* Measurement block index   */
/*00E*/ BYTE    pom;                    /* Path operational mask     */
/*00F*/ BYTE    pam;                    /* Path available mask       */
/*010*/ BYTE    chpid[8];               /* Channel path identifiers  */
/*018*/ BYTE    zone;                   /* SIE zone                  */
/*019*/ BYTE    flag25;                 /* Flag byte 25              */
/*01A*/ BYTE    flag26;                 /* Reserved byte - must be 0 */
/*01B*/ BYTE    flag27;                 /* Flag byte 27              */
    } PMCW;

/* Bit definitions for PMCW flag byte 4 */
#define PMCW4_Q         0x80            /* QDIO available            */
#define PMCW4_ISC       0x38            /* Interruption subclass     */
#define PMCW4_A         0x01            /* Alternate Block Control   */
#define PMCW4_RESV      0x46            /* Reserved bits - must be 0 */

/* Bit definitions for PMCW flag byte 5 */
#define PMCW5_E         0x80            /* Subchannel enabled        */
#define PMCW5_LM        0x60            /* Limit mode...             */
#define PMCW5_LM_NONE   0x00            /* ...no limit checking      */
#define PMCW5_LM_LOW    0x20            /* ...lower limit specified  */
#define PMCW5_LM_HIGH   0x40            /* ...upper limit specified  */
#define PMCW5_LM_RESV   0x60            /* ...reserved value         */
#define PMCW5_MM        0x18            /* Measurement mode enable...*/
